In [247]:
import numpy as np
import pandas as pd
a = pd.Series([1, np.nan, 3, None, 5, np.nan])
print(a)

0    1.0
1    NaN
2    3.0
3    NaN
4    5.0
5    NaN
dtype: float64

In [248]:
a = pd.Series([1, np.nan, 3, None, 5])
print(a + 1)
print(a * 2)

0    2.0
1    NaN
2    4.0
3    NaN
4    6.0
dtype: float64
0     2.0
1     NaN
2     6.0
3     NaN
4    10.0
dtype: float64

In [249]:
b = pd.Series([2, 4, 6, 8, 10])
print(a + b)

0     3.0
1     NaN
2     9.0
3     NaN
4    15.0
dtype: float64

In [250]:
print(a)
print(a.sum())
print(a.min())
print(a.max())
print(a.mean())

0    1.0
1    NaN
2    3.0
3    NaN
4    5.0
dtype: float64
9.0
1.0
5.0
3.0

In [251]:
print(a)
print(a.isna())

0    1.0
1    NaN
2    3.0
3    NaN
4    5.0
dtype: float64
0    False
1     True
2    False
3     True
4    False
dtype: bool

In [252]:
print(a.isnull())

0    False
1     True
2    False
3     True
4    False
dtype: bool

df.isna() returns a Boolean with True for missing values.

In [253]:
print(a[a.isna()])

1   NaN
3   NaN
dtype: float64

df.isnull() does the same as df.isna() : it returns True for values that are NaN.

In [254]:
print(a[a.isnull()])

1   NaN
3   NaN
dtype: float64

df.notnull() (or df.notna() ) returns True for values that are not NaN.

In [255]:
print(a)
print(a.notna())

0    1.0
1    NaN
2    3.0
3    NaN
4    5.0
dtype: float64
0     True
1    False
2     True
3    False
4     True
dtype: bool

In [256]:
print(a.notnull())

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [257]:
print(a[a.notna()])

0    1.0
2    3.0
4    5.0
dtype: float64

In [258]:
print(a[a.notnull()])

0    1.0
2    3.0
4    5.0
dtype: float64

In [259]:
print(a)
print(a.isna().any())

0    1.0
1    NaN
2    3.0
3    NaN
4    5.0
dtype: float64
True

In [260]:
print(a.isna())

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [261]:
print(a.isna().sum())

2

In [262]:
print(a.dropna())

0    1.0
2    3.0
4    5.0
dtype: float64

In [263]:
print(a.fillna(0))

0    1.0
1    0.0
2    3.0
3    0.0
4    5.0
dtype: float64

In [264]:
print(a.fillna("Missing"))

0        1.0
1    Missing
2        3.0
3    Missing
4        5.0
dtype: object

In [265]:
df = pd.DataFrame({"name": ["Jack", "Joe", "Charlie", "Frank", "Jonny"],
 "age": [31, 29, np.nan, 57, np.nan],
 "height": [np.nan, 193, 194, 183, 155]})
display(df)

      name   age  height
0     Jack  31.0     NaN
1      Joe  29.0   193.0
2  Charlie   NaN   194.0
3    Frank  57.0   183.0
4    Jonny   NaN   155.0

In [266]:
print(df.sum())

name      JackJoeCharlieFrankJonny
age                          117.0
height                       725.0
dtype: object

In [267]:
df.min()

name      Charlie
age          29.0
height      155.0
dtype: object

In [268]:
print(df.max())

name      Jonny
age        57.0
height    194.0
dtype: object

In [269]:
df.mean(numeric_only=True)

age        39.00
height    181.25
dtype: float64

In [270]:
print(df.isna())

    name    age  height
0  False  False    True
1  False  False   False
2  False   True   False
3  False  False   False
4  False   True   False

In [271]:
print(df.age.isna())

0    False
1    False
2     True
3    False
4     True
Name: age, dtype: bool

In [272]:
print(df.height.isna())

0     True
1    False
2    False
3    False
4    False
Name: height, dtype: bool

In [273]:
print(df[df.age.isna()])

      name  age  height
2  Charlie  NaN   194.0
4    Jonny  NaN   155.0

In [274]:
print(df.name[df.height.isna()])

0    Jack
Name: name, dtype: object

In [275]:
print(df.notna()) # return dataframe with booleans

   name    age  height
0  True   True   False
1  True   True    True
2  True  False    True
3  True   True    True
4  True  False    True

In [276]:
print(df.age.notna()) # returns serie with boolean values

0     True
1     True
2    False
3     True
4    False
Name: age, dtype: bool

In [277]:
print(df.height.notna())

0    False
1     True
2     True
3     True
4     True
Name: height, dtype: bool

In [278]:
print(df[df.height.notna()])

      name   age  height
1      Joe  29.0   193.0
2  Charlie   NaN   194.0
3    Frank  57.0   183.0
4    Jonny   NaN   155.0

In [279]:
print(df.age[df.height.notna()])

1    29.0
2     NaN
3    57.0
4     NaN
Name: age, dtype: float64

In [280]:
print(df.loc[df.height.notna(), ["name", "height"]])

      name  height
1      Joe   193.0
2  Charlie   194.0
3    Frank   183.0
4    Jonny   155.0

In [281]:
display(df)

      name   age  height
0     Jack  31.0     NaN
1      Joe  29.0   193.0
2  Charlie   NaN   194.0
3    Frank  57.0   183.0
4    Jonny   NaN   155.0

In [282]:
df.isna().any()

name      False
age        True
height     True
dtype: bool

In [283]:
df.isna().sum()

name      0
age       2
height    1
dtype: int64

In [284]:
df.fillna(0)

      name   age  height
0     Jack  31.0     0.0
1      Joe  29.0   193.0
2  Charlie   0.0   194.0
3    Frank  57.0   183.0
4    Jonny   0.0   155.0

In [285]:
df.fillna("Missing")

      name      age   height
0     Jack     31.0  Missing
1      Joe     29.0    193.0
2  Charlie  Missing    194.0
3    Frank     57.0    183.0
4    Jonny  Missing    155.0

In [286]:
df.fillna(method = 'ffill', axis = 1) # column

/tmp/ipykernel_20228/1975331486.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'ffill', axis = 1) # column

      name      age height
0     Jack     31.0   31.0
1      Joe     29.0  193.0
2  Charlie  Charlie  194.0
3    Frank     57.0  183.0
4    Jonny    Jonny  155.0

In [287]:
df.fillna(method = 'ffill', axis = 0) # row (default)

/tmp/ipykernel_20228/1555648055.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'ffill', axis = 0) # row (default)

      name   age  height
0     Jack  31.0     NaN
1      Joe  29.0   193.0
2  Charlie  29.0   194.0
3    Frank  57.0   183.0
4    Jonny  57.0   155.0

In [288]:
df.fillna(method = 'bfill', axis = 1) # column

/tmp/ipykernel_20228/2723862662.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'bfill', axis = 1) # column

      name    age height
0     Jack   31.0    NaN
1      Joe   29.0  193.0
2  Charlie  194.0  194.0
3    Frank   57.0  183.0
4    Jonny  155.0  155.0

In [289]:
df.fillna(method = 'bfill', axis = 0) # row

/tmp/ipykernel_20228/1137052672.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'bfill', axis = 0) # row

      name   age  height
0     Jack  31.0   193.0
1      Joe  29.0   193.0
2  Charlie  57.0   194.0
3    Frank  57.0   183.0
4    Jonny   NaN   155.0

In [290]:
display(df)

      name   age  height
0     Jack  31.0     NaN
1      Joe  29.0   193.0
2  Charlie   NaN   194.0
3    Frank  57.0   183.0
4    Jonny   NaN   155.0

In [291]:
df.fillna(df.mean(numeric_only=True), inplace = True)
display(df)

      name   age  height
0     Jack  31.0  181.25
1      Joe  29.0  193.00
2  Charlie  39.0  194.00
3    Frank  57.0  183.00
4    Jonny  39.0  155.00

In [292]:
# Setup df again to overwrite the inplace = True from the last line
df = pd.DataFrame({"name": ["Jack", "Joe", "Charlie", "Frank"],
 "age": [31, 29, np.nan, 57],
 "height": [np.nan, 193, 194, 183]})
display(df)
df.dropna()

      name   age  height
0     Jack  31.0     NaN
1      Joe  29.0   193.0
2  Charlie   NaN   194.0
3    Frank  57.0   183.0

    name   age  height
1    Joe  29.0   193.0
3  Frank  57.0   183.0

In [293]:
# Drop all columns containing a missing value
df.dropna(axis = "columns")

      name
0     Jack
1      Joe
2  Charlie
3    Frank

In [294]:
df.dropna(axis = 1)

      name
0     Jack
1      Joe
2  Charlie
3    Frank

In [295]:
df.dropna(axis = 'columns', how ='all')

      name   age  height
0     Jack  31.0     NaN
1      Joe  29.0   193.0
2  Charlie   NaN   194.0
3    Frank  57.0   183.0

In [296]:
df.dropna(axis = 'rows', thresh = 1)

      name   age  height
0     Jack  31.0     NaN
1      Joe  29.0   193.0
2  Charlie   NaN   194.0
3    Frank  57.0   183.0

In [297]:
df.dropna(axis = 'rows', thresh = 3)

    name   age  height
1    Joe  29.0   193.0
3  Frank  57.0   183.0

In [304]:
help(df.fillna)

Help on method fillna in module pandas.core.generic:

fillna(value: 'Hashable | Mapping | Series | DataFrame | None' = None, *, method: 'FillnaOptions | None' = None, axis: 'Axis | None' = None, inplace: 'bool_t' = False, limit: 'int | None' = None, downcast: 'dict | None | lib.NoDefault' = <no_default>) -> 'Self | None' method of pandas.core.frame.DataFrame instance
    Fill NA/NaN values using the specified method.

    Parameters
    ----------
    value : scalar, dict, Series, or DataFrame
        Value to use to fill holes (e.g. 0), alternately a
        dict/Series/DataFrame of values specifying which value to use for
        each index (for a Series) or column (for a DataFrame).  Values not
        in the dict/Series/DataFrame will not be filled. This value cannot
        be a list.
    method : {'backfill', 'bfill', 'ffill', None}, default None
        Method to use for filling holes in reindexed Series:

        * ffill: propagate last valid observation forward to next valid.
        * backfill / bfill: use next valid observation to fill gap.

        .. deprecated:: 2.1.0
            Use ffill or bfill instead.

    axis : {0 or 'index'} for Series, {0 or 'index', 1 or 'columns'} for DataFrame
        Axis along which to fill missing values. For `Series`
        this parameter is unused and defaults to 0.
    inplace : bool, default False
        If True, fill in-place. Note: this will modify any
        other views on this object (e.g., a no-copy slice for a column in a
        DataFrame).
    limit : int, default None
        If method is specified, this is the maximum number of consecutive
        NaN values to forward/backward fill. In other words, if there is
        a gap with more than this number of consecutive NaNs, it will only
        be partially filled. If method is not specified, this is the
        maximum number of entries along the entire axis where NaNs will be
        filled. Must be greater than 0 if not None.
    downcast : dict, default is None
        A dict of item->dtype of what to downcast if possible,
        or the string 'infer' which will try to downcast to an appropriate
        equal type (e.g. float64 to int64 if possible).

        .. deprecated:: 2.2.0

    Returns
    -------
    Series/DataFrame or None
        Object with missing values filled or None if ``inplace=True``.

    See Also
    --------
    ffill : Fill values by propagating the last valid observation to next valid.
    bfill : Fill values by using the next valid observation to fill the gap.
    interpolate : Fill NaN values using interpolation.
    reindex : Conform object to new index.
    asfreq : Convert TimeSeries to specified frequency.

    Examples
    --------
    >>> df = pd.DataFrame([[np.nan, 2, np.nan, 0],
    ...                    [3, 4, np.nan, 1],
    ...                    [np.nan, np.nan, np.nan, np.nan],
    ...                    [np.nan, 3, np.nan, 4]],
    ...                   columns=list("ABCD"))
    >>> df
         A    B   C    D
    0  NaN  2.0 NaN  0.0
    1  3.0  4.0 NaN  1.0
    2  NaN  NaN NaN  NaN
    3  NaN  3.0 NaN  4.0

    Replace all NaN elements with 0s.

    >>> df.fillna(0)
         A    B    C    D
    0  0.0  2.0  0.0  0.0
    1  3.0  4.0  0.0  1.0
    2  0.0  0.0  0.0  0.0
    3  0.0  3.0  0.0  4.0

    Replace all NaN elements in column 'A', 'B', 'C', and 'D', with 0, 1,
    2, and 3 respectively.

    >>> values = {"A": 0, "B": 1, "C": 2, "D": 3}
    >>> df.fillna(value=values)
         A    B    C    D
    0  0.0  2.0  2.0  0.0
    1  3.0  4.0  2.0  1.0
    2  0.0  1.0  2.0  3.0
    3  0.0  3.0  2.0  4.0

    Only replace the first NaN element.

    >>> df.fillna(value=values, limit=1)
         A    B    C    D
    0  0.0  2.0  2.0  0.0
    1  3.0  4.0  NaN  1.0
    2  NaN  1.0  NaN  3.0
    3  NaN  3.0  NaN  4.0

    When filling using a DataFrame, replacement happens along
    the same column names and same indices

    >>> df2 = pd.DataFrame(np.zeros((4, 4)), columns=list("ABCE"))
    >>> df.fillna(df2)
         A    B    C    D
    0  0.0  2.0  0.0  0.0
    1  3.0  4.0  0.0  1.0
    2  0.0  0.0  0.0  NaN
    3  0.0  3.0  0.0  4.0

    Note that column D is not affected since it is not present in df2.

In [302]:
import pandas as pd


df = pd.read_csv('data_missing.csv')

print("Original dataset:")
print(df)
print("\nDataset info:")
print(df.info())

Original dataset:
   ST_NUM     ST_NAME NUM_BEDROOMS OWN_OCCUPIED
0   104.0      PUTNAM            3            Y
1   197.0   LEXINGTON            3            N
2     NaN   LEXINGTON          NaN            N
3   201.0    BERKELEY            1           12
4   203.0    BERKELEY            3            Y
5   207.0    BERKELEY          NaN            Y
6     NaN  WASHINGTON            2          NaN
7   213.0     TREMONT           --            Y
8   215.0     TREMONT           na            Y

Dataset info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   ST_NUM        7 non-null      float64
 1   ST_NAME       9 non-null      object
 2   NUM_BEDROOMS  7 non-null      object
 3   OWN_OCCUPIED  8 non-null      object
dtypes: float64(1), object(3)
memory usage: 416.0+ bytes
None

Are there any unexpected values in the OWN_OCCUPIED column? If so, replace them with NaN.

In [311]:
df['OWN_OCCUPIED'].fillna('NaN')
display(df)

   ST_NUM     ST_NAME NUM_BEDROOMS OWN_OCCUPIED
0   104.0      PUTNAM            3            Y
1   197.0   LEXINGTON            3            N
2     NaN   LEXINGTON          NaN            N
3   201.0    BERKELEY            1          NaN
4   203.0    BERKELEY            3            Y
5   207.0    BERKELEY          NaN            Y
6     NaN  WASHINGTON            2          NaN
7   213.0     TREMONT           --            Y
8   215.0     TREMONT           na            Y

Use Python code to show which columns have missing values.

In [308]:
print(df.isnull().any())

ST_NUM           True
ST_NAME         False
NUM_BEDROOMS     True
OWN_OCCUPIED     True
dtype: bool

Find the number of missing values in each column.

In [313]:
df.isnull().sum()

ST_NUM          2
ST_NAME         0
NUM_BEDROOMS    2
OWN_OCCUPIED    2
dtype: int64

Filter the dataset so we only see the rows with no missing values.

In [316]:


df_clean = df.dropna()   

display(df)

display(df_clean)

   ST_NUM     ST_NAME NUM_BEDROOMS OWN_OCCUPIED
0   104.0      PUTNAM            3            Y
1   197.0   LEXINGTON            3            N
2     NaN   LEXINGTON          NaN            N
3   201.0    BERKELEY            1          NaN
4   203.0    BERKELEY            3            Y
5   207.0    BERKELEY          NaN            Y
6     NaN  WASHINGTON            2          NaN
7   213.0     TREMONT           --            Y
8   215.0     TREMONT           na            Y

   ST_NUM    ST_NAME NUM_BEDROOMS OWN_OCCUPIED
0   104.0     PUTNAM            3            Y
1   197.0  LEXINGTON            3            N
4   203.0   BERKELEY            3            Y
7   213.0    TREMONT           --            Y
8   215.0    TREMONT           na            Y

Filter the dataset so we only see the rows with two or less missing values.

In [331]:
# The before df.dropna(axis = 'rows', thresh = 2)

# treat known tokens as missing, then keep rows with at most 2 missing values
df_few_missing = df.replace(missing_values, np.nan).dropna(axis='rows', thresh=2)
display(df_few_missing)

   ST_NUM     ST_NAME NUM_BEDROOMS OWN_OCCUPIED
0   104.0      PUTNAM            3            Y
1   197.0   LEXINGTON            3            N
2     NaN   LEXINGTON          NaN            N
3   201.0    BERKELEY            1          NaN
4   203.0    BERKELEY            3            Y
5   207.0    BERKELEY          NaN            Y
6     NaN  WASHINGTON            2          NaN
7   213.0     TREMONT          NaN            Y
8   215.0     TREMONT          NaN            Y